/**
 * Создать класс program - ввод "class"(это называется снипед)
 * 
 * Снипед точка входа - "main"
 * 
 * Снипед обращение к консоли - "sysout"
 * 
 * F5 - запуск программы(также можно через "run")
 * 
 * 
 */
public class program {
   public static void main(String[] args) {
       System.out.println("--Пример текста--");
   }
    
}